#!/usr/bin/env python
# encoding: utf-8
# author: Think
# created: 2018/9/28 13:14

"""
  复软基础数据
"""

_RISCODE ={

        '0':'心电图检查',
        '1':'X线检查',
        '2':'超声检查',
        '3':'乳腺放射检查',
        '4':'CT检查',
        '5':'TCD检查',
        '6':'心脏彩超检查',
        '7':'核磁共振检查',
        '8':'X线透视',
        '9':'电子胃镜检查',
        '10':'电子肠镜检查',
        '11':'C14呼气检测',
        '12':'动态心电图',
        '13':'骨密度检查',
        '14':'眼部B超',
        '15':'OCT',
        '16':'眼底照相',
        '17':'眼前段照相',
        '18':'眼部A超',
        '19':'电生理',
        '20':'视网膜视力检测',
        '22':'视野检查',
        '24':'角膜内皮计数',
        '25':'IOL-Master',
        '26':'UBM',
        '27':'欧宝照相',
        '28':'扫描激光眼底检查',
        '29':'眼相差检查',
        '30':'角膜地形图检查',
        '31':'颈动脉超声',
        '32':'眼部超声',
        '33':'阴囊超声',
        '34':'甲状腺超声',
        '35':'盆腔超声',
        '36':'乳房超声',
        '37':'胎儿超声',
        '38':'泌尿系超声',
        '39':'肝胆胰脾超声',
        '40':'心超',
 }


def getBaseName(code):
    return _RISCODE.get(code)





